#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
google_iam_workload_identity_pool.mypool: Refreshing state... [id=projects/sandbox-411907/locations/global/workloadIdentityPools/mypool]
data.google_service_account.terraform_sa: Reading...
google_project_service.enable_api["iam.googleapis.com"]: Refreshing state... [id=sandbox-411907/iam.googleapis.com]
google_project_service.enable_api["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=sandbox-411907/cloudresourcemanager.googleapis.com]
google_project_service.enable_api["sts.googleapis.com"]: Refreshing state... [id=sandbox-411907/sts.googleapis.com]
google_project_service.enable_api["iamcredentials.googleapis.com"]: Refreshing state... [id=sandbox-411907/iamcredentials.googleapis.com]
google_iam_workload_identity_pool_provider.myprovider: Refreshing state... [id=projects/sandbox-411907/locations/global/workloadIdentityPools/mypool/providers/myprovider]
data.google_service_account.terraform_sa: Read complete after 0s [id=projects/sandbox-411907/serviceAccounts/terraform@sandbox-411907.iam.gserviceaccount.com]
google_service_account_iam_member.terraform_sa: Refreshing state... [id=projects/sandbox-411907/serviceAccounts/terraform@sandbox-411907.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/85897917453/locations/global/workloadIdentityPools/mypool/attribute.repository/rom6621/iac-sandbox]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.test001 will be created
  + resource "google_storage_bucket" "test001" {
      + effective_labels            = (known after apply)
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "sandbox-411907-bucket-test001"
      + project                     = "sandbox-411907"
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = true
      + url                         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @rom6621, Action: `pull_request`, Working Directory: ``, Workflow: `terraform`*